{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Hey there!",
        "Good morning!",
        "Good afternoon!",
        "Good evening!",
        "Sup",
        "Hi there",
        "Hey!",
        "Howdy",
        "Yo",
        "Greetings",
        "Hiya",
        "What's up?",
        "How's it going?",
        "Hello there",
        "Hi, how are you?",
        "Hey, what's up?",
        "Hello everyone",
        "Hi all",
        "Morning!",
        "Afternoon!",
        "Evening!",
        "Hey, is anyone here?",
        "Hello, anyone around?",
        "Good to see you",
        "Pleasant Morning to you!",
        "Pleasant Afternoon to you!",
        "Pleasant Evening to you!",
        "Salutations!",
        "Good to see you!",
        "Hey, you!",
        "Ahoy!",
        "Hola!",
        "Bonjour!",
        "Annyeonghaseyo",
        "Hello po"
      ],
      "responses": [
        "Welcome! How can I be helpful to you today? Please let me know how I can best support you with your current request.",
        "Hello there! What can I do for you today? I'm ready to address your inquiries or provide any guidance you may require.",
        "Hi there! How may I be of assistance to you at this time? I'm happy to address your needs and ensure you receive the help you're seeking."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Can you help me?",
        "Hi. Can you help me?",
        "Hi. I need your help.",
        "I need help with something",
        "Can you assist me?",
        "I need some help.",
        "Could you help me out?",
        "Can I get some help?",
        "I need assistance.",
        "Help me, please.",
        "Could you give me a hand?",
        "Can you aid me?",
        "I need your assistance.",
        "Can you support me?",
        "I require help.",
        "Please help me.",
        "Hi, I need help.",
        "Hey, can you help me?",
        "Hello, I need some help.",
        "I could use some help.",
        "Is there anyone who can help me?",
        "Can you help me with something?",
        "I need help with this.",
        "Can someone help me?",
        "I require your assistance.",
        "I'd appreciate your help.",
        "Can you provide some help?",
        "I need a little help with something.",
        "Could you help me figure this out?",
        "Will you lend a hand?",
        "Help",
        "I want your help.",
        "I need your help."
      ],
      "responses": [
        "Hello, how may I assist you today? I'm here to help address any questions or needs you may have.",
        "Hello, how can I be helpful to you? I'm ready to address your questions or provide any information or guidance you may need.",
        "Hi there, how may I be of assistance to you today? Please let me know how I can best help you with your request or needs."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Catch you later",
        "Farewell",
        "See you soon",
        "Take care",
        "Later",
        "Peace out",
        "Bye for now",
        "I'm off",
        "I'm leaving",
        "'Till next time",
        "Adios",
        "Bye-bye",
        "See ya",
        "I'm out",
        "Thank you, bye",
        "Talk to you later",
        "Sayonara!",
        "So long, partner!",
        "Adieu!",
        "Have a good one!",
        "Good night!",
        "Ciao!",
        "Later, Gator",
        "Fare thee well!",
        "Until later!",
        "Bon voyage!",
        "Hasta la vista!",
        "It's been a pleasure."
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks.",
        "Thank you.",
        "That's helpful.",
        "Thank's a lot!",
        "Thanks you.",
        "Good Job!",
        "Thank you so much.",
        "Much appreciated.",
        "Thanks, I appreciate it.",
        "Thanks for your help.",
        "Thanks for the info.",
        "Thanks for the information.",
        "Thank you very much.",
        "I appreciate your help.",
        "I'm grateful.",
        "Thank you for your assistance.",
        "Many thanks.",
        "Thanks a bunch.",
        "Got it, thanks.",
        "Thanks a ton.",
        "Thanks, you're a lifesaver.",
        "Thank you kindly.",
        "I really appreciate it!",
        "Much obliged.",
        "I owe you one.",
        "Thanks a million!",
        "I can't thank you enough.",
        "Thanks a ton!",
        "You've been a great help, thank you.",
        "Thanks for everything.",
        "You've been incredibly helpful!",
        "Thanks for everything.",
        "That's all, thank you.",
        "Alright, thanks.",
        "I'm good, thank you.",
        "I think I'm good, thanks.",
        "I understand, thanks.",
        "You've been helpful.",
        "I have no more questions, thank you.",
<<<<<<< HEAD
        "Alright, thanks."
=======
        "Nothing else",
        "Nothing more"
>>>>>>> bea0bc9605b25349099f1f52ecaaa56f47b8c2e9
      ],
      "responses": [
        "I'm glad that I helped you. Is there anything else that I can assist you with?",
        "Any time, I'm happy to help! Is there anything else that I can help you with?",
        "My pleasure, I'm here to help you if you need anything!"
      ]
    },
    {
      "tag": "services",
      "patterns": [
        "What services do you offer?",
        "Can you tell me about Doctor Suzy Roxas's services?",
        "What kind of work does Doctor Suzy Roxas do?",
        "I'm curious about the services available.",
        "Could you list the services you provide?",
        "What solutions do you offer?",
        "I'd like to know more about you.",
        "What services do you offer?",
        "What are your services?",
        "What your services?",
        "What you do?",
        "Services?",
        "I would like to inquire about your services",
        "Can I ask questions about your services?",
        "I would like to ask about the possible services you provide",
        "What is your service?",
        "I want to see your services.",
        "Give me services.",
        "What services do you cater?",
        "What services do you provide?",
        "Do you provide marketing services?",
        "Do you do marketing?",
        "What does Doctor Suzy Roxas specialize in?",
        "Can you describe the services you provide?",
        "What can you do for me?",
        "What kind of projects do you handle?",
        "Are there specific services that you are known for?",
        "What services can I avail from your company?",
        "What does your company do?",
        "Services",
        "Can you list down your services?",
        "I wish to see your services?",
        "Could you please tell me about your services?",
        "Tell me about your services",
        "Share with me your services",
        "Can you elaborate to me about your services?",
        "What are the services that you can provide?"
      ],
      "responses": [
        "Dr. Suzy Roxas specializes in Cognitive Therapy, focusing on present thinking, behaviors, and communication for problem-solving and personal development.",
        "Dr. Suzy Roxas is an expert in Cognitive Therapy, emphasizing current thoughts, behaviors, and communication to aid in problem-solving and personal growth.",
        "Dr. Suzy Roxas excels in Cognitive Therapy, targeting current thoughts, behaviors, and communication to enhance problem-solving and personal development."
      ]
    },
    {
      "tag": "fee",
      "patterns": [
        "How much is your service?",
        "What would it cost?",
        "How much do you charge for your services?",
        "Can you tell me the cost of your service?",
        "What are your rates for this service?",
        "What is the price for a single session of this service?",
        "May I ask how much your services cost?",
        "Could you let me know your pricing for this service?",
        "Would you mind sharing the cost of your service with me?",
        "What are the typical costs for your service?",
        "What is the cost for a one-hour consultation?",
        "How much would it be to schedule an initial session?",
        "Can you tell me the fees for ongoing sessions?"
      ],
      "responses": [
        "Dr. Suzy's fee per session is ₱5,500."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "How do I reach out to Dr. Suzy Roxas for additional information?",
        "How do I reach out to Doctor Suzy Roxas for additional information?",
        "What's the best way to get in touch with Dr. Suzy Roxas?",
        "What's the best way to get in touch with Doctor. Suzy Roxas?",
        "Can you provide Dr. Suzy Roxas' contact details?",
        "Can you provide Doctor Suzy Roxas' contact details?",
        "How do I reach out to Dr. Suzy Roxas for further inquiries?",
        "How do I reach out to Doctor Suzy Roxas for further inquiries?",
        "Where can I find Dr. Suzy Roxas' contact information?",
        "Where can I find Doctor Suzy Roxas' contact information?",
        "Could you tell me how to connect with Doctor Suzy Roxas?",
        "Could you tell me how to connect with Dr. Suzy Roxas?",
        "How can I contact Dr. Suzy Roxas?",
        "How can I contact Doctor Suzy Roxas?",
        "How do I contact your company?",
        "How do I contact your clinic?",
        "Who do I contact for internship opportunities?",
        "Could you tell me how to connect with someone?",
        "What is Dr. Suzy Roxas' email?",
        "What is Doctor Suzy Roxas' email?",
        "What is your email?",
        "How can I send a message to Dr. Suzy Roxas?",
        "How can I send a message to Doctor Suzy Roxas?",
        "Who should I reach out to for customer support?",
        "Can you tell me how to get in touch with your customer service team?",
        "Where can I send my inquiries to Dr. Suzy Roxas?",
        "Where can I send my inquiries to Doctor Suzy Roxas?",
        "How do I communicate with Dr. Suzy Roxas?",
        "How do I communicate with Doctor Suzy Roxas?",
        "Could you provide Dr. Suzy Roxas' contact number?",
        "Could you provide Doctor Suzy Roxas' contact number?",
        "What is the best way to contact Dr. Suzy Roxas?",
        "What is the best way to contact Doctor Suzy Roxas?",
        "Do you think I can talk to her today?",
        "I would like to speak to Dr. Suzy Roxas.",
        "I would like to speak to Doctor Suzy Roxas.",
        "I want to talk to Dr. Suzy Roxas.",
        "I want to talk to Doctor Suzy Roxas."
      ],
      "responses": [
        "If you would like to contact Dr. Suzy Roxas please feel free to email her at Suzy_roxas@yahoo.com. Please note that she does not provide her telephone or cellphone number."
      ]
    },
    {
      "tag": "Internship_Inquiry",
      "patterns": [
        "Internship?",
        "OJT?",
        "Do you have an internship?",
        "Are there any internships available?",
        "Appreciate it, Can I work as an intern for Dr. Suzy Roxas?",
        "Appreciate it, Can I work as an intern for Doctor Suzy Roxas?",
        "Are there any OJT opportunities at your clinic?",
        "How can I apply for an internship at your clinic?",
        "Do you offer internships for students?",
        "Can I get an internship position at your clinic?",
        "Is Doctor Suzy Roxas hiring interns?",
        "Is Dr. Suzy Roxas hiring interns?",
        "How do I become an intern?",
        "What is the process to apply for an internship?",
        "Do you have any openings for internships?",
        "Who do I contact for internship opportunities?",
        "Can international students apply for internships?",
        "Can I apply for an OJT?",
        "Can I apply for an Internship?",
        "Do you accept On The Job Training Students?",
        "Do you take in students for an internship?",
        "I'm looking for an internship opportunity.",
        "Do you have an OJT program?",
        "Could you elaborate on the details of your internship?",
        "Oh I see, is there any on the job training in your company?"
      ],
      "responses": [
        "Dr. Suzy Roxas accepts interns, kindly send us an email to Suzy_roxas@yahoo.com with your CV and endorsement letter from your school if you are interested."
      ]
    },
    {
      "tag": "Internship_Duration",
      "patterns": [
        "What are the minimum hours required to complete the internship?",
        "How long is the duration of the internship?",
        "How many hours does your company require us to complete our OJT?",
        "How long is your OJT program?",
        "How many hours do I need to complete my internship with you?",
        "How long is the internship at Nexxus Lab?",
        "How long do I need to work for you to complete my OJT?",
        "How long do I need to work for you to complete my internship?",
        "May I ask how long is the work period for OJT?",
        "Is it possible to have OJT within the required hours of my University?",
        "What is the required hours for the internship?",
        "What is the minimum amount of hours for the internship?",
        "Do you have a set amount of work hours for an internship?",
        "Do you have a specific amount of work hours for OJT?",
        "Can you tell me the internship duration of your clinic?",
        "Can you elaborate to me the internship duration of your clinic?",
        "How long will I be staying to complete my internship?",
        "How many hours do I need to render for the internship?"
      ],
      "responses": [
        "Dr. Suzy Roxas doesn't have a specific minimum number of hours required for completing your internship. You will only follow the hours required by your school to ensure you meet their criteria for the internship."
      ]
    },
    {
      "tag": "Internship_Requirements",
      "patterns": [
        "What are your requirements for an internship?",
        "What documents do I have to send when applying for an OJT?",
        "What documents do I have to send when applying for an Internship?",
        "What are the files I need to submit to apply for an OJT?",
        "What are the files I need to submit to apply for an Internship?",
        "Required documents for OJT.",
        "Required files for OJT.",      
        "How can I get an internship?",
        "Required documents for Internship.",
        "Required files for Internship.",
        "Do I need to submit a Resume and a cover letter?",
        "Is the internship paid?",
        "Will I get paid?",
        "What are the requirements for an internship with Dr. Suzy Roxas?",
        "Is this a paid internship?",
        "Do you provide a paid-internship?",
        "Do I have to sign an NDA form?",
        "Do I have to sign a Non-Disclosure Agreement?",
        "How do I apply for an OJT?",
        "What are the requirements?",
        "Hello, how can I take my internship in your clinic?",
        "Hello, how can I take my internship in your company?",
        "How can I take my internship in your clinic?",
        "How can I take my internship in your company?"
      ],
      "responses": [
        "Dr. Suzy Roxas requires aspiring interns to submit their CV and endorsement letter from their university. Keep in mind that this is a non-paid internship and we will require you to sign a Non-Disclosure Agreement when you're accepted."
      ]
    },
    {
      "tag": "Internship_Details",
      "patterns": [
        "What are the tasks if I were to apply for an internship at your company?",
        "What responsibilities will I be doing for OJT?",
        "What are the positions available for internship?",
        "What are the roles available for internship?",
        "What kind of tasks should I expect when I apply for an internship?",
        "Are there any training programs for interns?",
        "What can I expect to learn during my internship?",
        "Can you give an overview of the intern responsibilities?",
        "What kind of assignments do interns receive?",
        "What specific responsibilities are assigned to interns?",
        "What kind of projects will interns be working on?",
        "What type of work will I be involved in as an intern?",
        "Can you outline the tasks for an internship role?",
        "Can you tell me what interns do in your company?",
        "What is the workload for interns?",
        "What roles should I keep in mind if I plan to be an intern?",
        "Tell me role expectations for the internship.",
        "List of positions for the internship",
        "List of roles for the internship."
      ],
      "responses": [
        "Dr. Suzy Roxas offer roles in Social media manager, researcher, and ebook writer. Interns will gain hands-on experience in their chosen field, working on real projects and collaborating with Doctor Suzy Roxas herself."
      ]
    },
    {
      "tag": "Schedule",
      "patterns": [
        "What is Dr. Suzy Roxas' availability?",
        "When is Dr. Suzy Roxas available for appointments?",
        "Can you tell me Dr. Suzy Roxas' schedule?",
        "What are Dr. Suzy Roxas' working hours?",
        "When can I book an appointment with Dr. Suzy Roxas?",
        "How do I schedule a meeting with Dr. Suzy Roxas?",
        "What times is Dr. Suzy Roxas available?",
        "Can you provide Dr. Suzy Roxas' office hours?",
        "What is the best time to reach Dr. Suzy Roxas?",
        "When does Dr. Suzy Roxas take appointments?",
        "How do I book a slot with Dr. Suzy Roxas?",
        "I need an appointment with Dr. Suzy Roxas.",
        "I need an appointment with Doctor Suzy Roxas.",
        "I need an appointment, I'm not feeling well.",
        "What days is Dr. Suzy Roxas available?",
        "Is Dr. Suzy Roxas available on weekends?",
        "Can I schedule an appointment with Dr. Suzy Roxas during evenings?",
        "What are the consultation hours for Dr. Suzy Roxas?",
        "When is Dr. Suzy Roxas free for consultations?",
        "What are Dr. Suzy Roxas' consulting hours?",
        "When is the next available appointment with Dr. Suzy Roxas?",
        "How can I check Dr. Suzy Roxas' availability?",
        "What is Dr. Suzy Roxas' timetable?",
        "Do you know when I can see Dr. Suzy Roxas?",
        "Do you know when I can see Doctor Suzy Roxas?",
        "When can I see the doctor?",
        "When can I see Dr. Suzy Roxas?",
        "When can I see Doctor Suzy Roxas?",
        "Do you know when I can see Doctor Suzy Roxas?",
        "I need some consulting",
        "Can you book me an appointment?",
        "Appointment?",
        "Is there any way that I can book an appointment?"
      ],
      "responses": [
        "Dr. Suzy Roxas is available from Monday to Friday at 10:00 AM - 6:00 PM. If you are interested in booking an appointment, please contact us at Suzy_roxas@yahoo.com, and we'll reach out to you promptly."
      ]
    },    
    {
      "tag": "Vague_inquiry",
      "patterns": [
        "What about me?",
        "mobile games?",
        "What?",
        "How?",
        "When?",
        "Why?",
        "Text?",
        "May I?",
        "Let them?",
        "May we?",
        "Can you?",
        "Can we?",
        "Let's?",
        "What is?",
        "Shall we?",
        "Let him",
        "Let her",
        "you?",
        "we?",
        "uhh?",
        "Ahhh?",
        "Uhuh?",
        "Hmmm",
        "Uhm",
        "Me?",
        "What is?",
        "AI?"
      ],
      "responses": [
        "I'm sorry, but can you please elaborate on that?",
        "Could you please provide more details? I'd be glad to help, but I need a bit more information to give you a thorough response.",
        "Could you please give me more details? I'd be happy to help once I understand your request better."
      ]
    },
    {
      "tag": "Filler",
      "patterns": [
        "Oh ok.",
        "I see",
        "Okay.",
        "ok",
        "ohhh",
        "Oh I see",
        "oh okay.",
        "Got it.",
        "Alright.",
        "Understood.",
        "Sure.",
        "Ah, I get it.",
        "Hmm, makes sense.",
        "Alright then.",
        "Okay, gotcha.",
        "I understand.",
        "Makes sense.",
        "Okay, I see now.",
        "Ah, okay.",
        "Gotcha.",
        "I see what you mean.",
        "Okay, understood.",
        "Alright, got it.",
        "Okay, that makes sense.",
        "Okay, cool.",
        "Alright, makes sense,",
        "Ah, got it.",
        "Noted",
        "Okay, thanks for letting me know",
        "Oki"
      ],
      "responses": [
        "Is there anything else I can help you with?"
      ]
    },
    {
      "tag": "unknown",
      "patterns": [
        "What about me?",
        "mobile games?",
        "Are you a girl?",
        "Are you boy?",
        "Are you gay?",
        "Support Pride?",
        "This is so cool!",
        "That's so cool!",
        "Are you flirting with me?"
      ],
      "responses": [
        "I apologize, but I don't have details on that topic. As an AI assistant, I'm focused on providing information about Dr. Suzy Roxas's cognitive therapy services. Is there anything specific I can assist you with regarding her offerings, pricing, or how to get started working with her?",
        "Unfortunately, I don't have the information you're looking for. However, I'd be happy to help with any questions you have about the services provided by Dr. Suzy Roxas, a cognitive therapist. Please let me know if you need assistance with understanding her treatment approaches or any other aspects of working with her practice.",
        "I don't have details on that particular subject. As an AI assistant, my knowledge is centered around Dr. Suzy Roxas's cognitive therapy practice. Is there anything I can clarify for you about her services, the consultation process, or how to begin working with her as a patient?"
      ]
    },
    {
      "tag": "Mura",
      "patterns": [
        "Putang Ina mo!",
        "Tangina mo",
        "Tang ina ka",
        "Gago ka ba?",
        "Gago ka",
        "Bobo ka ba?",
        "Tanga ka ba?",
        "Tanga ka?",
        "Tanga",
        "Bobo",
        "Bobo mo naman kausap.",
        "Hayop ka!",
        "Gago",
        "Putang ina",
        "Tang ina"
      ],
      "responses": [
        "Please refrain from saying bad words."
      ]
    },
    {
      "tag": "Immediate",
      "patterns": [
        "What is cognitive therapy?",
        "Can you define cognitive therapy?",
        "What's the definition of cognitive therapy?",
        "What conditions can cognitive therapy treat?",
        "What can cognitive therapy help with?",
        "How does cognitive therapy work?",
        "What does cognitive therapy do?",
        "What does cognitive therapy do to help?",
        "How can I calm myself down?",
        "How do I deal with my trauma?",
        "I have PTSD, What should I do?",
        "Help me I'm having a panick attack.",
        "I'm suffering from PTSD, can you help me?",
        "I'm suffering from trauma, can you help me?",
        "I'm depressed.",
        "I need help, I'm depressed.",
        "I've been feeling down lately",
        "I'm suicidal.",
        "I want to kill myself.",
        "Can you help me with my depression?",
        "Can you calm me down?"
      ],
      "responses": [
        "Please email Dr. Suzy immediately at Suzy_roxas@yahoo.com to schedule an appointment for diagnosis and an in depth explanation of your concerns."
      ]
    }
  ]
}
